### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "050c3a5d1e2f769bf015d9cfbd201c47" -> "2aac8d1ce42401c16ffb34d3ad4fe8bb" # forces replacement
!       id                     = "https://tamughtrnodra94.blob.core.windows.net/$web/index.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "index.html"
!       url                    = "https://tamughtrnodra94.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
  